//любой алгоритм должен обладать св-вами массовости(должен создаваться для решения задач определенного класса)

/* результативность,формализованность

программа - набор инструкций, выполняемых компьютером

программирование - процесс создания компьютерных программ

язык программирования - формальный язык для написания программ

JavaScript - это объектно-ориентированный язык программирования сценариев

Используется для создания интерактивных веб-страниц и веб-приложения

Основан на спецификации ECMAScrip

Сценарий JavaScript(скрипт) - это программа которые выполняются на компьютере пользователя при загрузке
с сервера вместе с веб-страницей

Консоль(Console) - используется для отладки сценариев на JavaScript.

Возможности JavaScript: 

В браузере:
    создавать новые страницы
    изменять содержимое страниц
    модифицировать стили офромления страниц
    реагировать на действия пользователя
    отправлять стетвые запросы на удаленные сервера
    скачивать и загружать файлы
    получать и устанавливать cookies
    запоминать данные на стороне клиента

Особенности скрпитов javascript:
    распространяются и выполняются как простой текст
    не требуется специальная подготовка для запуска(компилятор)
    выполняются на любом устройстве, которое имеет специальную программу (движок ДжаваСкрипт)

Cookie - небольшой фрагмент данных отправленный веб-сервером и хранимы на компьютером пользователя.
используется веб серверами

Движок браузера - виртуальная машина javascript

Примеры движков:
    V8 - Chrome, Opera
    SpiderMonkey - Firefox
    ChakraCode, Chromium - Microsoft Edge
    Nitro, SquirrelFish - Safari

Структура программы:
раздел задания(описания) констант и переменных;
раздел ввода исходных данных;
раздел обработки данных;
раздел вывода полученных результатов;

Элементы программы:
комментарии
оператор(инструкция)
*/
